** generating some with elisp


#+NAME:otherbehaviors
#+begin_example
  tln: tln {
    compatible = "zmk,behavior-toggle-layer";
    #binding-cells = <1>;
    display-name = "Toggle Layer On";
    toggle-mode = "on";
  };
  tlf: tlf {
    compatible = "zmk,behavior-toggle-layer";
    #binding-cells = <1>;
    display-name = "Toggle Layer Off";
    toggle-mode = "off";
  };
#+end_example

#+begin_src elisp
(cl-defun zmk-org-mod-morph (name base withmod &optional (mods '("LSFT" "RSFT")) (binding name))
  "Make a mod-morph device tree entry.
Provide the NAME which is also the default BINDING.
BASE is the behavior without any of the MODS, while WITHMOD is the
behavior with MODS held. MODS are given as a list with available values of
`LSFT' `RSFT' `LCTL' `RCTL' `LALT' `RALT' `LGUI' `RGUI'"
  (let ((fmods (mapconcat (apply-partially #'format "MOD_%s") mods "|"))
        (templ (s-join "\n" '("  %s: %s {"
                              "    compatible = \"zmk,behavior-mod-morph\";"
                              "    #binding-cells = <0>;"
                              "    bindings = <%s>, <%s>;"
                              "    mods = <(%s)>;"
                              "  };"))))
    (format templ binding name base withmod fmods)))

(defun mapsplat (fun seq)
  "Map a SPLAT'ed version of FUN over SEQ."
  (mapcar (lambda (args) (apply fun args)) seq))
(defun map-cartesian-product (fun seqa seqb)
  "FUN over all combinations of SEQA and SEQB."
  (mapcar (lambda (sb)
            (mapcar (lambda (sa) (funcall fun sa sb)) seqa))
          seqb))

(let* ((modargs '(("mm_dotlpar" "&kp DOT" "&kp LPAR" ("LSFT"))
                  ("u_out_tog" "&out OUT_TOG" " &out OUT_USB")
                  ("u_caps_word" "&caps_word" "&kp CAPSLOCK")))
       (bt_bhvs (map-cartesian-product #'format
                                       '("u_bt_sel_%d" "&bt BT_SEL %d" "&bt_clr_%d")
                                       (number-sequence 0 4)))
       (mod-morphs (mapsplat #'zmk-org-mod-morph (append modargs bt_bhvs)))
       (other (list (org-babel-ref-resolve "otherbehaviors"))))
  (format "behaviors {\n%s\n};" (s-join "\n" (append mod-morphs other))))
#+end_src

#+RESULTS:
#+begin_example
behaviors {
  mm_dotlpar: mm_dotlpar {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&kp DOT>, <&kp LPAR>;
    mods = <(MOD_LSFT)>;
  };
  u_out_tog: u_out_tog {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&out OUT_TOG>, < &out OUT_USB>;
    mods = <(MOD_LSFT|MOD_RSFT)>;
  };
  u_caps_word: u_caps_word {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&caps_word>, <&kp CAPSLOCK>;
    mods = <(MOD_LSFT|MOD_RSFT)>;
  };
  u_bt_sel_0: u_bt_sel_0 {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&bt BT_SEL 0>, <&bt_clr_0>;
    mods = <(MOD_LSFT|MOD_RSFT)>;
  };
  u_bt_sel_1: u_bt_sel_1 {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&bt BT_SEL 1>, <&bt_clr_1>;
    mods = <(MOD_LSFT|MOD_RSFT)>;
  };
  u_bt_sel_2: u_bt_sel_2 {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&bt BT_SEL 2>, <&bt_clr_2>;
    mods = <(MOD_LSFT|MOD_RSFT)>;
  };
  u_bt_sel_3: u_bt_sel_3 {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&bt BT_SEL 3>, <&bt_clr_3>;
    mods = <(MOD_LSFT|MOD_RSFT)>;
  };
  u_bt_sel_4: u_bt_sel_4 {
    compatible = "zmk,behavior-mod-morph";
    #binding-cells = <0>;
    bindings = <&bt BT_SEL 4>, <&bt_clr_4>;
    mods = <(MOD_LSFT|MOD_RSFT)>;
  };
  tln: tln {
    compatible = "zmk,behavior-toggle-layer";
    #binding-cells = <1>;
    display-name = "Toggle Layer On";
    toggle-mode = "on";
  };
  tlf: tlf {
    compatible = "zmk,behavior-toggle-layer";
    #binding-cells = <1>;
    display-name = "Toggle Layer Off";
    toggle-mode = "off";
  };

};
#+end_example


